Repository: linhay/nolon
Catalog: nolon/Localizable.xcstrings
Source language: en
Languages: zh_hans

# codex.features.source.tag.nolon_compatibility
source: Nolon Compatibility
zh_hans: Nolon 兼容

# codex.runtime.action.refresh
source: Refresh
zh_hans: 刷新

# codex.runtime.bool.false
source: false
zh_hans: 否

# codex.runtime.bool.true
source: true
zh_hans: 是

# codex.runtime.diag.accounts
source: Accounts
zh_hans: 账号数

# codex.runtime.diag.active
source: Active
zh_hans: 活跃账号

# codex.runtime.diag.binary
source: Binary
zh_hans: 二进制版本

# codex.runtime.diag.executable
source: Executable
zh_hans: 可执行文件

# codex.runtime.diag.hint
source: Hint
zh_hans: 提示

# codex.runtime.diag.path_active
source: Path Active
zh_hans: Path 生效

# codex.runtime.diag.running
source: Running
zh_hans: 运行中

# codex.runtime.diagnostics.empty
source: No diagnostics available.
zh_hans: 暂无诊断信息。

# codex.runtime.diagnostics.title
source: Diagnostics
zh_hans: 诊断信息

# codex.runtime.error.title
source: Runtime Error
zh_hans: 运行时错误

# codex.runtime.force_stop.action
source: Force Stop PID %d
zh_hans: 强制停止 PID %d

# codex.runtime.force_stop.message
source: This sends SIGKILL directly. Use only when normal stop fails.
zh_hans: 该操作会直接发送 SIGKILL，仅在普通停止失败时使用。

# codex.runtime.force_stop.title
source: Force Stop
zh_hans: 强制停止

# codex.runtime.logs.clear
source: Clear
zh_hans: 清空

# codex.runtime.logs.empty
source: No log output in selected window.
zh_hans: 当前时间窗口内没有日志输出。

# codex.runtime.logs.refresh
source: Refresh Logs
zh_hans: 刷新日志

# codex.runtime.logs.select_pid
source: Select a process to view logs.
zh_hans: 请选择一个进程查看日志。

# codex.runtime.logs.title
source: PID Logs
zh_hans: 进程日志

# codex.runtime.process.force
source: Force
zh_hans: 强制

# codex.runtime.process.stop
source: Stop
zh_hans: 停止

# codex.runtime.processes.empty
source: No running Codex processes.
zh_hans: 当前没有运行中的 Codex 进程。

# codex.runtime.processes.title
source: Runtime Processes
zh_hans: 运行中进程

# codex.usage.empty.desc
source: No threads found for the selected time range.
zh_hans: 所选时间范围内未找到线程。

# codex.usage.empty.title
source: No usage
zh_hans: 暂无用量

# codex.usage.error.load
source: Failed to load usage from Codex state.sqlite.
zh_hans: 无法从 Codex state.sqlite 读取用量。

# codex.usage.error.open_db
source: Failed to open Codex state database.
zh_hans: 无法打开 Codex state 数据库。

# codex.usage.error.title
source: Failed to load usage
zh_hans: 加载用量失败

# codex.usage.group.title
source: Usage & Cost
zh_hans: 用量与花费

# codex.usage.no_db.desc
source: Codex state.sqlite was not found in your Codex home directory.
zh_hans: 在 Codex Home 目录中未找到 state.sqlite。

# codex.usage.no_db.title
source: No usage data
zh_hans: 暂无用量数据

# codex.usage.projects.empty
source: No projects found.
zh_hans: 未找到项目。

# codex.usage.projects.title
source: Top projects
zh_hans: 项目排行

# codex.usage.range.label
source: Range
zh_hans: 时间范围

# codex.usage.range.today
source: Today
zh_hans: 今天

# codex.usage.title
source: Usage
zh_hans: 用量

# codex.usage.total.threads
source: Threads
zh_hans: 线程

# codex.usage.total.tokens
source: Total tokens
zh_hans: 总 Tokens

source: Command
zh_hans: 命令

source: Configuration
zh_hans: 配置

source: Copy Command
zh_hans: 复制命令

source: Create Configuration
zh_hans: 创建配置

source: Description
zh_hans: 描述

source: Design System Colors
zh_hans: 设计系统颜色

source: Details
zh_hans: 详情

source: Documentation
zh_hans: 文档

source: Done
zh_hans: 完成

source: Edit
zh_hans: 编辑

source: Edit Config
zh_hans: 编辑配置

source: Edit Configuration
zh_hans: 编辑配置

source: Edit Provider
zh_hans: 编辑提供方

source: Edit Repository
zh_hans: 编辑仓库

# edit_provider.vendor_category
source: Vendor Category
zh_hans: 厂商分类

source: Enable Workflow
zh_hans: 启用工作流

source: Enter your token
zh_hans: 输入您的 Token

source: Environment Variables
zh_hans: 环境变量

source: Error Loading Data
zh_hans: 加载数据出错

source: Generate a token from your Git provider's settings with 'read_repository' scope.
zh_hans: 在您的 Git 提供商设置中生成具有 'read_repository' 范围的令牌。

# generic.create
source: Create
zh_hans: 创建

source: Git Repository
zh_hans: Git 仓库

source: Install
zh_hans: 安装

source: Install '%@' to...
zh_hans: 安装 '%@' 到...

source: Install %@
zh_hans: 安装 %@

source: Install to
zh_hans: 安装到

source: Install to %@
zh_hans: 安装到 %@

source: Install to:
zh_hans: 安装到：

source: Install to: %@
zh_hans: 安装到：%@

# install_method.copy
source: Copy
zh_hans: 复制 (Copy)

# install_method.symlink
source: Symbolic Link
zh_hans: 软链接 (Symlink)

source: Installations
zh_hans: 安装状态

source: Installed
zh_hans: 已安装

# language.ja
source: Japanese
zh_hans: 日本語

# language.system
source: System
zh_hans: 系统

# language.zh-Hans
source: Simplified Chinese
zh_hans: 简体中文

# language.zh-Hant
source: Traditional Chinese
zh_hans: 繁體中文

source: Latest Changes
zh_hans: 最新更改

source: MCP configuration file not found.
zh_hans: 未找到 MCP 配置文件。

# mcp.action.disable
source: Disable
zh_hans: 禁用

# mcp.action.enable
source: Enable
zh_hans: 启用

# mcp.action.migrate_to_cache
source: Migrate to Nolon
zh_hans: 迁移到 Nolon

# mcp.editor.invalid_config.title
source: Invalid Configuration
zh_hans: 配置无效

# mcp.editor.invalid_json
source: Invalid JSON.
zh_hans: JSON 无效。

# mcp.editor.title
source: Edit MCP
zh_hans: 编辑 MCP

# mcp.field.args
source: Args (one per line)
zh_hans: 参数（每行一个）

# mcp.field.command
source: Command
zh_hans: 命令

# mcp.field.enabled
source: Enabled
zh_hans: 已启用

# mcp.field.env
source: Env (KEY=VALUE, one per line)
zh_hans: 环境变量（KEY=VALUE，每行一个）

# mcp.field.name
source: Name
zh_hans: 名称

# mcp.migration.single.success
source: Migrated.
zh_hans: 已迁移。

# mcp.migration.single.updated
source: Updated.
zh_hans: 已更新。

# mcp.no_command
source: No command specified
zh_hans: 未指定命令

# mcp.section.command
source: Command
zh_hans: 命令

# mcp.section.connection
source: Connection
zh_hans: 连接

# mcp.section.env
source: Environment
zh_hans: 环境

# mcp.workflow
source: Workflow
zh_hans: 工作流

source: Metadata
zh_hans: 元数据

source: Name
zh_hans: 名称

source: No command specified
zh_hans: 未指定命令

source: No Configuration
zh_hans: 无配置

source: No detailed description available.
zh_hans: 暂无详细描述。

source: No file selected
zh_hans: 未选择文件

source: No matching MCP servers found
zh_hans: 未找到匹配的 MCP 服务器

source: No matching MCPs found
zh_hans: 未找到匹配的 MCP

source: No matching workflows found
zh_hans: 未找到匹配的工作流

source: No MCP servers configured.
zh_hans: 未配置 MCP 服务器。

source: No MCPs
zh_hans: 无 MCP

source: No MCPs in this repository
zh_hans: 此仓库中无 MCP

source: No providers available. Please create a local provider first.
zh_hans: 无可用 Provider。请先创建一个本地 Provider。

source: No Results
zh_hans: 无结果

source: No Servers
zh_hans: 无服务器

source: No Workflows
zh_hans: 无工作流

source: No workflows in this repository
zh_hans: 此仓库中无工作流

source: Not synced
zh_hans: 未同步

# onboarding.button.back
source: Back
zh_hans: 返回

# onboarding.button.continue
source: Continue
zh_hans: 继续

# onboarding.button.get_started
source: Get Started
zh_hans: 开始使用

# onboarding.button.skip
source: Skip
zh_hans: 跳过

# onboarding.button.start
source: Start Using nolon
zh_hans: 开始使用 nolon

# onboarding.completion.more_providers %lld
source: and %lld more...
zh_hans: 还有 %lld 个...

# onboarding.completion.providers_configured %lld
source: %lld Providers Configured
zh_hans: 已配置 %lld 个 Provider

# onboarding.completion.subtitle
source: You're ready to start managing skills.
zh_hans: 你已准备好开始管理技能。

# onboarding.completion.tip_add_provider
source: Click + in sidebar to add more providers
zh_hans: 点击侧边栏的 + 添加更多 Provider

# onboarding.completion.tip_clawdhub
source: Click Cloud button to browse Clawdhub skills
zh_hans: 点击云图标浏览 Clawdhub 技能

# onboarding.completion.tips_title
source: Pro Tips
zh_hans: 使用技巧

# onboarding.completion.title
source: All Set!
zh_hans: 配置完成！

# onboarding.feature.clawdhub.description
source: Browse and install skills from the marketplace
zh_hans: 从技能市场浏览并安装技能

# onboarding.feature.clawdhub.title
source: Clawdhub Marketplace
zh_hans: Clawdhub 市场

# onboarding.feature.github.description
source: Add skills via GitHub repo URL or skills.sh
zh_hans: 通过 GitHub 仓库链接或 skills.sh 添加技能

# onboarding.feature.github.title
source: Easy Skill Import
zh_hans: 快速导入技能

# onboarding.feature.unified.description
source: Manage skills for Claude, Cursor, Gemini & more
zh_hans: 管理 Claude、Cursor、Gemini 等多个工具的技能

# onboarding.feature.unified.title
source: Unified Skill Management
zh_hans: 统一技能管理

# onboarding.provider.detected
source: Detected
zh_hans: 已检测

# onboarding.provider.selected_count %lld
source: %lld selected
zh_hans: 已选择 %lld 个

# onboarding.provider.subtitle
source: Choose the tools you use. You can add more later.
zh_hans: 选择你使用的工具，之后可以随时添加更多。

# onboarding.provider.subtitle_detected
source: We detected the following installed. You can add more later.
zh_hans: 已检测到以下已安装的工具，之后可以随时添加更多。

# onboarding.provider.title
source: Select Your AI Coding Agents
zh_hans: 选择你的 AI Coding Agent

# onboarding.welcome.subtitle
source: Manage AI Coding Skills Across All Your Favorite Agents
zh_hans: 跨多个 AI Coding Agent 统一管理技能

# onboarding.welcome.title
source: Welcome to nolon
zh_hans: 欢迎使用 nolon

source: Path (e.g., skills, .agent)
zh_hans: 路径（例如 skills, .agent）

source: Personal Access Token
zh_hans: 个人访问令牌

# provider.cli.error.no_terminal
source: No supported terminal app found. Install Terminal or iTerm.
zh_hans: 未检测到可用终端应用，请安装 Terminal 或 iTerm。

# provider.cli.error.open_terminal
source: Unable to open terminal app.
zh_hans: 无法打开终端应用。

# provider.cli.error.title
source: CLI Error
zh_hans: CLI 错误

# provider.cli.open
source: Open CLI
zh_hans: 打开 CLI

# provider.codex_xcode.linked_hint.add
source: Add Codex Provider
zh_hans: 添加 Codex Provider

# provider.codex_xcode.linked_hint.jump
source: Jump to Codex
zh_hans: 跳转到 Codex

# provider.codex_xcode.linked_hint.title
source: Linked to Codex
zh_hans: 已链接到 Codex

# provider.codex_xcode.notice.desc
source: Uses Xcode's Codex folder at ~/Library/Developer/Xcode/CodingAssistant/codex for skills, workflows, and MCP. Account and usage are managed by Xcode.
zh_hans: 使用 Xcode 的 Codex 目录（~/Library/Developer/Xcode/CodingAssistant/codex）管理 Skills / Workflows / MCP。账号与用量由 Xcode 管理。

# provider.codex_xcode.notice.title
source: Xcode Built-in Codex
zh_hans: Xcode 内置 Codex

# provider.mcp.not_supported_native
source: This provider does not expose a native MCP configuration file.
zh_hans: 此 Provider 没有原生 MCP 配置文件。

# provider.resources.health.orphaned_skills_scroll
source: Scroll to first orphaned skill
zh_hans: 滚动到第一个孤立技能

# provider.secondary_resource.commands
source: Command Folder
zh_hans: 命令文件夹

# provider.secondary_resource.prompts
source: Prompt Folder
zh_hans: 提示词文件夹

# provider.secondary_resource.workflows
source: Workflow Folder
zh_hans: 工作流文件夹

# provider.vendor_category.integrated
source: Integrated Vendors
zh_hans: 集成厂商

# provider.vendor_category.original
source: Original Vendors
zh_hans: 原始厂商

source: Refresh
zh_hans: 刷新

source: Refresh installed status
zh_hans: 刷新安装状态

# remote.detail.files_title
source: Files
zh_hans: 文件

# remote.detail.local_badge
source: Local
zh_hans: 本地

# remote.detail.local_details_title
source: Local Details
zh_hans: 本地信息

# remote.detail.path_label
source: Path
zh_hans: 路径

# remote.detail.summary_title
source: Summary
zh_hans: 简介

# remote.detail.updated_label
source: Updated
zh_hans: 更新

# remote.error.copied
source: Copied
zh_hans: 已复制

# remote.error.title
source: Error Loading Data
zh_hans: 数据加载失败

# remote.load_more
source: Load More
zh_hans: 加载更多

# remote.load_more.end
source: You have reached the end.
zh_hans: 已经到底了

# remote.load_more.loading
source: Loading...
zh_hans: 正在加载...

# remote.mcps.empty
source: No MCPs
zh_hans: 暂无 MCP

# remote.mcps.empty_desc
source: No MCPs in this repository
zh_hans: 此仓库暂无 MCP

# remote.retry
source: Retry
zh_hans: 重试

# remote.search.no_results
source: No Results
zh_hans: 无结果

# remote.search.placeholder
source: Search
zh_hans: 搜索

# remote.searching
source: Searching...
zh_hans: 正在搜索...

# remote.workflows.empty
source: No Workflows
zh_hans: 暂无流程

# remote.workflows.empty_desc
source: No workflows in this repository
zh_hans: 此仓库暂无流程

source: Remove
zh_hans: 移除

source: Repositories
zh_hans: 仓库

source: Repository Root
zh_hans: 仓库根目录

source: Repository Type
zh_hans: 仓库类型

# resource.center.title
source: Resource Center
zh_hans: 资源中心

# resource.delete.result.partial
source: %1$@ "%2$@" deleted with partial failures. Success: %3$ld/%4$ld %5$@
zh_hans: 已删除%1$@“%2$@”，但部分目标失败。 成功：%3$ld/%4$ld %5$@

# resource.delete.result.success
source: %1$@ "%2$@" deleted. Removed from %3$ld provider(s).
zh_hans: 已删除%1$@“%2$@”。已从 %3$ld 个 Provider 中移除。

source: Reveal in Finder
zh_hans: 在 Finder 中显示

source: Save
zh_hans: 保存

source: Save & Retry
zh_hans: 保存并重试

source: Search
zh_hans: 搜索

# search.placeholder
source: Search
zh_hans: 搜索

source: select
zh_hans: 选择

# Select %lld director%@
source: Select %1$lld director%2$@
zh_hans: 选择 %lld 个目录%@

source: Select a folder containing skill directories (each with a SKILL.md file).
zh_hans: 选择一个包含 Skill 目录的文件夹（每个目录需包含 SKILL.md 文件）。

source: Select a provider folder where this skill will be installed.
zh_hans: 选择此 Skill 的安装目录。

source: Select a provider...
zh_hans: 选择一个 Provider...

source: Select one or more directories containing skills:
zh_hans: 选择一个或多个包含技能的目录：

source: Select Provider
zh_hans: 选择 Provider

# settings.about.check_updates
source: Check for updates
zh_hans: 检查更新

# settings.about.description
source: Desktop workspace for managing agent assets and distributing skills, memory docs, and sync rules.
zh_hans: 用于管理智能体资产、分发技能、内存文档和同步规则的桌面工作区。

# settings.advanced.skill_lock.confirm_action
source: Rebuild
zh_hans: 重建

# settings.advanced.skill_lock.confirm_message
source: This will scan your global skills folder and write .skill-lock.json. You can keep existing entries or overwrite them.
zh_hans: 此操作会扫描你的全局技能目录并写入 .skill-lock.json。你可以保留已有记录或选择覆盖。

# settings.advanced.skill_lock.confirm_title
source: Rebuild Skill Lock?
zh_hans: 重建 Skill Lock？

# settings.advanced.skill_lock.description
source: Rebuild the .skill-lock.json file by scanning ~/.nolon/skills. This helps update checking work for existing installations.
zh_hans: 扫描 ~/.nolon/skills 并重建 .skill-lock.json。用于修复/启用已安装技能的更新检查。

# settings.advanced.skill_lock.failed
source: Failed to rebuild: %@
zh_hans: 重建失败：%@

# settings.advanced.skill_lock.overwrite
source: Overwrite existing entries
zh_hans: 覆盖已有记录

# settings.advanced.skill_lock.rebuild
source: Rebuild .skill-lock.json
zh_hans: 重建 .skill-lock.json

# settings.advanced.skill_lock.running
source: Rebuilding .skill-lock.json...
zh_hans: 正在重建 .skill-lock.json...

# settings.advanced.updates.open
source: Manage skill updates
zh_hans: 管理技能更新

# settings.advanced.updates.title
source: Updates
zh_hans: 更新

# settings.app
source: Settings...
zh_hans: 应用

# settings.appearance
source: Appearance
zh_hans: 外观

# settings.category.about
source: About
zh_hans: 关于

# settings.category.advanced
source: Advanced
zh_hans: 高级

# settings.category.display
source: Display
zh_hans: 显示

# settings.category.general
source: General
zh_hans: 通用

# settings.importing.title
source: Importing
zh_hans: 导入

# settings.language
source: Language
zh_hans: 语言

# settings.onboarding.description
source: Quick setup for your experience
zh_hans: 快速配置您的使用体验

# settings.onboarding.rerun
source: Re-run Onboarding
zh_hans: 重新开始引导

# settings.project_configuration.title
source: Project Configuration
zh_hans: 项目配置

# settings.title
source: Settings
zh_hans: 设置

# settings.unlinking.ask
source: Ask every time
zh_hans: 每次询问

# settings.unlinking.ask_desc
source: Show a confirmation dialog with the option to delete synced files
zh_hans: 显示确认对话框，并提供删除同步文件的选项

# settings.unlinking.delete
source: Delete synced files
zh_hans: 删除同步文件

# settings.unlinking.delete_desc
source: Skip confirmation, delete both the link and synced files
zh_hans: 跳过确认，同时删除链接和同步的文件

# settings.unlinking.keep
source: Keep synced files
zh_hans: 保留同步文件

# settings.unlinking.keep_desc
source: Skip confirmation, only remove the link (files remain in project)
zh_hans: 跳过确认，仅移除链接（文件保留在项目中）

# settings.workspace.current
source: Current Workspace
zh_hans: 当前工作区

source: Show as Grid
zh_hans: 以网格显示

source: Show as List
zh_hans: 以列表显示

# sidebar.providers.integrated_vendors
source: Integrated Vendors
zh_hans: 集成厂商

# sidebar.providers.original_vendors
source: Original Vendors
zh_hans: 原始厂商

# sidebar.providers.projects
source: Projects
zh_hans: 项目

# sidebar.providers.vendors
source: Vendors
zh_hans: 厂商

# sidebar.tools.accounts
source: Accounts
zh_hans: 账号

# skill.orphaned
source: Needs Migration
zh_hans: 游离

source: Skills Folder
zh_hans: Skills 文件夹

source: Skills Paths
zh_hans: 技能路径

# skills.primary_path
source: Primary Path
zh_hans: 主路径

source: Sources
zh_hans: 来源

source: SSH Authentication Unavailable
zh_hans: SSH 身份验证不可用

source: SSH key is not configured for **%@**. Please provide a Personal Access Token to authenticate.
zh_hans: 未为 **%@** 配置 SSH 密钥。请提供个人访问令牌进行身份验证。

source: SSH key is not configured for %@. Please provide a Personal Access Token to authenticate.
zh_hans: 未为 %@ 配置 SSH 密钥。请提供个人访问令牌以进行身份验证。

source: Statistics
zh_hans: 统计

# status.broken_desc
source: Link target missing. Repair or delete.
zh_hans: 技能文件已损坏

# status.linked
source: Linked
zh_hans: 已链接

# status.local
source: Local
zh_hans: 本地

# status.local_desc
source: Not managed. Migrate to enable syncing.
zh_hans: 技能仅在本地存在

# status.not_linked
source: Not Linked
zh_hans: 未链接

# status.synced
source: Synced
zh_hans: 已同步

# status.synced_desc
source: Managed by Nolon. Changes sync automatically.
zh_hans: 技能已与仓库同步

source: Supports GitHub, GitLab, Bitbucket and other Git hosting services.
zh_hans: 支持 GitHub、GitLab、Bitbucket 和其他 Git 托管服务。

source: Sync
zh_hans: 同步

source: Syncing repository...
zh_hans: 正在同步仓库...

# tab.accounts
source: Accounts
zh_hans: 账号

# tab.advanced
source: Advanced
zh_hans: 高级配置

# tab.agents
source: Agents
zh_hans: 代理说明

# tab.rules
source: Rules
zh_hans: 规则

# tab.usage
source: Usage
zh_hans: 用量

source: Template
zh_hans: 模板

source: Unable to read file
zh_hans: 无法读取文件

# usage.metric.resets_at
source: Resets %@
zh_hans: 重置于 %@

# usage.metric.updated_at
source: Snapshot %@
zh_hans: 快照于 %@

# usage.monitor.codex.refresh_timeout
source: Codex refresh timed out after %.0f seconds.
zh_hans: Codex 刷新在 %.0f 秒后超时。

source: View Details
zh_hans: 查看详情

source: Workflow
zh_hans: 工作流

source: Workflow Folder
zh_hans: 工作流文件夹

# workflow.source.skill
source: Skill
zh_hans: 技能

# workflow.source.unknown
source: Unknown
zh_hans: 未知

# workflow.source.user
source: User
zh_hans: 用户
